Revit 2026 API

# RebarBarTypeGetHookLength Method

---

Identifies the hook length for a hook type

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetHookLength(
	ElementId hookId
)
```
```vb
Public Function GetHookLength (
	hookId As ElementId
) As Double
```
```cpp
public:
double GetHookLength(
	ElementId^ hookId
)
```
```fsharp
member GetHookLength :
        hookId : ElementId -> float
```

#### Parameters

hookId ElementId
     id of the hook type

#### Return Value

Double The hook length for a hook type

| Exception | Condition |
| --- | --- |
| ArgumentException | the rebar hook type id hookId is not valid |
| ArgumentNullException | A non-optional argument was null |

If the AutoCalcHookLengths property is turned off, the default hook length will be returned

#### Reference

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace